# Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел.
# У пользователя необходимо запрашивать новый элемент рейтинга.
# Если в рейтинге существуют элементы с одинаковыми значениями,
# то новый элемент с тем же значением должен разместиться после них.
#
# Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
# Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
# Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
# Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
# Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2].

raiting = int(input('Введите оценку от 0 до 9: '))
my_list = [7, 5, 3, 1]
x = my_list.count(raiting)
for element in my_list:
    if x > 0:
        i = my_list.index(raiting)
        my_list.insert(i + x, raiting)
        break
    else:
        if raiting > element:
            j = my_list.index(element)
            my_list.insert(j, raiting)
            break
        elif raiting < my_list[len(my_list) - 1]:
            my_list.append(raiting)
print(f'Рейтинг - {my_list}')
